DataProcessors/АР_РегистрацияСчетовФактурНаАвансАгентская.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>АР_РегистрацияСчетовФактурНаАвансАгентская</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СФсформирован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНаОплату</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФактура</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокументаОснования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокРегистрацииСчетовФактурНаАванс</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

AccumulationRegisters/НДСАвансыПоДоговорамКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>НДСАвансыПоДоговорамКомиссии</Name>
			<Comment>НДС авансы по договорам комиссии</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комиссионер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПредметовЛизинга</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ВыполнениеРегламентныхОперацийНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеРегламентныхОперацийНДС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегламентныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПокупок</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеНулевойСтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейРаздела7ДекларацииНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьРегистрацияОплатыНДСВБюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеОплатыНДСВБюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДСПоОбъектамНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегламентнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РегламентныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектТекущейОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПорядокРегистрацииСчетовФактурНаАванс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПорядокРегистрацииСчетовФактурНаАванс</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаВсеАвансы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КромеЗачтенныхВТечениеПятиДней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КромеЗачтенныхВТечениеМесяца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КромеЗачтенныхВТечениеНалоговогоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРегистрироватьСчетаФактурыНаАвансы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/АР_РегистрацияСчетовФактурНаАвансАгентская/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ

Процедура ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища) Экспорт

	ДанныеДляЗаполнения = Новый Структура;

	Список = СтруктураПараметров.Список;
	ЗаполнитьСтрокиДокумента(СтруктураПараметров, Список);
	ДанныеДляЗаполнения.Вставить("Список", Список);

	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);

КонецПроцедуры

Процедура ЗаполнитьСтрокиДокумента(СтруктураПараметров, ТаблицаРезультатов)

	ПорядокРегистрацииСчетовФактурНаАванс = УчетнаяПолитика.ПорядокРегистрацииСчетовФактурНаАванс(
		СтруктураПараметров.Организация, СтруктураПараметров.КонецПериода);

	СоответствиеСтавок = Новый Соответствие();
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС10, Перечисления.СтавкиНДС.НДС10_110);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС18, Перечисления.СтавкиНДС.НДС18_118);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС20_120);

	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ТекущийПорядокРегистрацииСчетовФактурНаАванс", ПорядокРегистрацииСчетовФактурНаАванс);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);

	МассивСчетовАвансов = Новый Массив();
	//МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным); // 62.02
	//МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымВал); // 62.22
	//МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымУЕ); // 62.32
	
	МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.03.4"));  //-са
	
	// Движения по курсовым разницам не должны вызывать регистрации аванса
	Запрос.УстановитьПараметр("МассивСчетовАвансов", МассивСчетовАвансов);

	СубконтоСчРасчетов_ЕстьДР = Новый Массив();
	СубконтоСчРасчетов_ЕстьДР.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоСчРасчетов_ЕстьДР.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	СубконтоСчРасчетов_ЕстьДР.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	Запрос.УстановитьПараметр("СубконтоСчРасчетов_ЕстьДР", СубконтоСчРасчетов_ЕстьДР);

	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецДня(СтруктураПараметров.КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(СтруктураПараметров.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериодаДата", КонецДня(СтруктураПараметров.КонецПериода));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ УсловиеСчета
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&МассивСчетовАвансов)
	|	И Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСконтрагентами)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизаций.Период КАК ПериодДействияС,
	|	УчетнаяПолитикаОрганизаций.ПорядокРегистрацииСчетовФактурНаАванс,
	|	МИНИМУМ(ЕСТЬNULL(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(УчетнаяПолитикаОрганизаций1.Период, ДЕНЬ, -1), ДЕНЬ), КОНЕЦПЕРИОДА(&КонецПериодаДата, ГОД))) КАК ПериодДействияПо
	|ПОМЕСТИТЬ УчетнаяПолитикаПериоды
	|ИЗ
	|	РегистрСведений.УдалитьУчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдалитьУчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций1
	|		ПО УчетнаяПолитикаОрганизаций.Период < УчетнаяПолитикаОрганизаций1.Период
	|			И (УчетнаяПолитикаОрганизаций1.Организация = &Организация)
	|			И (УчетнаяПолитикаОрганизаций1.Период <= &КонецПериодаДата)
	|ГДЕ
	|	УчетнаяПолитикаОрганизаций.Организация = &Организация
	|	И УчетнаяПолитикаОрганизаций.Период <= &КонецПериодаДата
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетнаяПолитикаОрганизаций.ПорядокРегистрацииСчетовФактурНаАванс,
	|	УчетнаяПолитикаОрганизаций.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Период КАК Период,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Контрагент,
	|	ХозрасчетныйОстаткиИОбороты.Субконто2 КАК ДоговорКонтрагента,
	|	ХозрасчетныйОстаткиИОбороты.Субконто3 КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Валютный
	|				И НЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаКонечныйОстаток ЕСТЬ NULL 
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.Валюта
	|		ИНАЧЕ &ВалютаРегламентированногоУчета
	|	КОНЕЦ КАК ВалютаРасчетов,
	|	-1 * ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток,
	|	-1 * ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
	|	-1 * ВЫБОР
	|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Валютный
	|				И ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаНачальныйОстаток, 0) <> 0
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаНачальныйОстаток
	|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток
	|	КОНЕЦ КАК ВалютныйНачальныйОстаток,
	|	-1 * ВЫБОР
	|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Валютный
	|				И ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаКонечныйОстаток, 0) <> 0
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаКонечныйОстаток
	|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|	КОНЕЦ КАК ВалютныйКонечныйОстаток,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов).РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах
	|ПОМЕСТИТЬ ХозрасчетныйОстатки
	|ИЗ
	|	УсловиеСчета КАК УсловиеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , , &СубконтоСчРасчетов_ЕстьДР, Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	|		ПО УсловиеСчета.Ссылка = ХозрасчетныйОстаткиИОбороты.Счет
	|ГДЕ
	|	(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток < 0
	|			ИЛИ ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток < 0)
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансыПоДоговорамКомиссии.Период,
	|	АвансыПоДоговорамКомиссии.ДатаСобытия КАК ДатаСобытия,
	|	АвансыПоДоговорамКомиссии.Организация,
	|	АвансыПоДоговорамКомиссии.Покупатель КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
	|	АвансыПоДоговорамКомиссии.СтавкаНДС КАК СтавкаНДС,
	|	АвансыПоДоговорамКомиссии.СчетФактура КАК ДокументОснование,
	|	&ВалютаРегламентированногоУчета КАК ВалютаРасчетов,
	|	АвансыПоДоговорамКомиссии.СуммаБезНДСКонечныйОстаток + АвансыПоДоговорамКомиссии.НДСКонечныйОстаток КАК КонечныйОстаток,
	|	АвансыПоДоговорамКомиссии.СуммаБезНДСНачальныйОстаток + АвансыПоДоговорамКомиссии.НДСНачальныйОстаток КАК НачальныйОстаток,
	|	АвансыПоДоговорамКомиссии.СуммаБезНДСНачальныйОстаток + АвансыПоДоговорамКомиссии.НДСНачальныйОстаток КАК ВалютныйНачальныйОстаток,
	|	АвансыПоДоговорамКомиссии.СуммаБезНДСКонечныйОстаток + АвансыПоДоговорамКомиссии.НДСКонечныйОстаток КАК ВалютныйКонечныйОстаток,
	|	ЛОЖЬ КАК РасчетыВУсловныхЕдиницах,
	|	&ТекущийПорядокРегистрацииСчетовФактурНаАванс КАК ПорядокРегистрацииСчетовФактурНаАванс
	|ПОМЕСТИТЬ ВТРасчеты
	|ИЗ
	|	РегистрНакопления.НДСАвансыПоДоговорамКомиссии.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , Организация = &Организация) КАК АвансыПоДоговорамКомиссии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Период,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ХозрасчетныйОстатки.Организация,
	|	ХозрасчетныйОстатки.Контрагент,
	|	ХозрасчетныйОстатки.ДоговорКонтрагента,
	|	NULL,
	|	ХозрасчетныйОстатки.ДокументОснование,
	|	ХозрасчетныйОстатки.ВалютаРасчетов,
	|	ХозрасчетныйОстатки.КонечныйОстаток,
	|	ХозрасчетныйОстатки.НачальныйОстаток,
	|	ХозрасчетныйОстатки.ВалютныйНачальныйОстаток,
	|	ХозрасчетныйОстатки.ВалютныйКонечныйОстаток,
	|	ХозрасчетныйОстатки.РасчетыВУсловныхЕдиницах,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.ДоговорКонтрагента.ПорядокРегистрацииСчетовФактурНаАвансПоДоговору = ЗНАЧЕНИЕ(Перечисление.ПорядокРегистрацииСчетовФактурНаАванс.ПустаяСсылка)
	|				ИЛИ ХозрасчетныйОстатки.ДоговорКонтрагента.ПорядокРегистрацииСчетовФактурНаАвансПоДоговору ЕСТЬ NULL 
	|			ТОГДА ЕСТЬNULL(УчетнаяПолитикаПериоды.ПорядокРегистрацииСчетовФактурНаАванс, &ТекущийПорядокРегистрацииСчетовФактурНаАванс)
	|		ИНАЧЕ ХозрасчетныйОстатки.ДоговорКонтрагента.ПорядокРегистрацииСчетовФактурНаАвансПоДоговору
	|	КОНЕЦ
	|ИЗ
	|	ХозрасчетныйОстатки КАК ХозрасчетныйОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитикаПериоды КАК УчетнаяПолитикаПериоды
	|		ПО (УчетнаяПолитикаПериоды.ПериодДействияС <= ХозрасчетныйОстатки.Период)
	|			И (УчетнаяПолитикаПериоды.ПериодДействияПо >= ХозрасчетныйОстатки.Период)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АвансыПоДоговорамКомиссии.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.Период КАК Период,
	|	Расчеты.Организация,
	|	Расчеты.Контрагент,
	|	Расчеты.ДоговорКонтрагента,
	|	Расчеты.ДокументОснование,
	|	Расчеты.ВалютаРасчетов,
	|	0 КАК СуммаАванса,
	|	0 КАК ВалютнаяСуммаАванса,
	|	Расчеты.КонечныйОстаток,
	|	Расчеты.НачальныйОстаток,
	|	Расчеты.ВалютныйКонечныйОстаток,
	|	Расчеты.ВалютныйНачальныйОстаток,
	|	Расчеты.РасчетыВУсловныхЕдиницах,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВыписки,
	|	Расчеты.ПорядокРегистрацииСчетовФактурНаАванс,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК КонецНалоговогоПериода,
	|	Расчеты.ДатаСобытия,
	|	Расчеты.СтавкаНДС,
	|	ЕСТЬNULL(РеквизитыДокументовОплаты.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДокументАвансаДата
	|ИЗ
	|	ВТРасчеты КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК РеквизитыДокументовОплаты
	|		ПО (РеквизитыДокументовОплаты.Организация = &Организация)
	|			И Расчеты.ДокументОснование = РеквизитыДокументовОплаты.Документ
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Расчеты.ПорядокРегистрацииСчетовФактурНаАванс = ЗНАЧЕНИЕ(Перечисление.ПорядокРегистрацииСчетовФактурНаАванс.НеРегистрироватьСчетаФактурыНаАвансы)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";

	Если СтруктураПараметров.Структура_ТипыДокументовАванса.Количество() > 0 Тогда
		
		ОграничениеТиповДокументов = "";

		Для Каждого ТипДокументовАванса Из СтруктураПараметров.Структура_ТипыДокументовАванса Цикл
			ОграничениеТиповДокументов = ОграничениеТиповДокументов + ?(ПустаяСтрока(ОграничениеТиповДокументов),
				" И ( ", " ИЛИ ") + "Субконто3 ССЫЛКА Документ." + ТипДокументовАванса.Ключ;
		КонецЦикла;

		ОграничениеТиповДокументов = ОграничениеТиповДокументов+") ";

		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			", Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты", 
			", Организация = &Организация " + ОграничениеТиповДокументов + ") КАК ХозрасчетныйОстаткиИОбороты");
			
	КонецЕсли;

	ТаблицаАвансовТекущая = Запрос.Выполнить().Выгрузить();

	Авансы = ТаблицаАвансовТекущая.Скопировать(, "ДокументОснование, Контрагент, ДатаСобытия, СтавкаНДС, ДоговорКонтрагента");
	Авансы.Свернуть("ДокументОснование, Контрагент, ДатаСобытия, СтавкаНДС, ДоговорКонтрагента");
	
	ТаблицаАвансовТекущая.Колонки.Добавить("СчетФактура", Новый ОписаниеТипов("ДокументСсылка.СчетФактураВыданный"));
	ОпределитьРанееВыписанныеСчетаФактуры(ТаблицаАвансовТекущая);

	ТаблицаАвансовТекущая.Индексы.Добавить("ДокументОснование, Контрагент, ДатаСобытия, СтавкаНДС");
	ТаблицаАвансов = ТаблицаАвансовТекущая.СкопироватьКолонки();

	ПоискПартии = Новый Структура("ДокументОснование, Контрагент, ДатаСобытия, СтавкаНДС, ДоговорКонтрагента");

	Для	Каждого Аванс Из Авансы Цикл

		ЗаполнитьЗначенияСвойств(ПоискПартии, Аванс);
		Таблица = ТаблицаАвансовТекущая.НайтиСтроки(ПоискПартии);

		ПорядокРегистрацииСчетовФактурНаАванс = Таблица[0].ПорядокРегистрацииСчетовФактурНаАванс;
		
		Для	Каждого Строка Из Таблица Цикл
			
			Если ТипЗнч(Строка.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
				ДатаПоступленияАванса = Строка.ДатаСобытия;
			Иначе	
				ДатаПоступленияАванса = Строка.ДокументАвансаДата;
			КонецЕсли;	
			
			// Вычислим крайнюю дату зачета аванса
			Если ПорядокРегистрацииСчетовФактурНаАванс = Перечисления.ПорядокРегистрацииСчетовФактурНаАванс.КромеЗачтенныхВТечениеПятиДней Тогда
				Если КонецДня(ДатаПоступленияАванса + 345600) > КонецКвартала(ДатаПоступленияАванса) Тогда
					ДатаЗачетаАванса = КонецКвартала(ДатаПоступленияАванса);
				Иначе
					ДатаЗачетаАванса = КонецДня(ДатаПоступленияАванса + 345600);
				КонецЕсли;
			ИначеЕсли ПорядокРегистрацииСчетовФактурНаАванс = Перечисления.ПорядокРегистрацииСчетовФактурНаАванс.КромеЗачтенныхВТечениеМесяца Тогда
				ДатаЗачетаАванса = КонецМесяца(ДатаПоступленияАванса);
			ИначеЕсли ПорядокРегистрацииСчетовФактурНаАванс = Перечисления.ПорядокРегистрацииСчетовФактурНаАванс.КромеЗачтенныхВТечениеНалоговогоПериода Тогда
				ДатаЗачетаАванса = КонецКвартала(ДатаПоступленияАванса);
			ИначеЕсли ПорядокРегистрацииСчетовФактурНаАванс = Перечисления.ПорядокРегистрацииСчетовФактурНаАванс.НаВсеАвансы Тогда
				ДатаЗачетаАванса = КонецДня(ДатаПоступленияАванса);
			Иначе
				ДатаЗачетаАванса = КонецДня(ДатаПоступленияАванса);
			КонецЕсли;				
			
			Если ДатаЗачетаАванса < СтруктураПараметров.НачалоПериода Тогда
				ДатаЗачетаАванса = СтруктураПараметров.НачалоПериода;
			КонецЕсли;
			
			Если ДатаЗачетаАванса > КонецДня(Строка.Период) Тогда
				Продолжить;
			ИначеЕсли КонецДня(ДатаЗачетаАванса) = КонецДня(Строка.Период) И Строка.КонечныйОстаток = 0 Тогда
				Продолжить;
			Иначе
				Если КонецДня(ДатаЗачетаАванса) = КонецДня(Строка.Период) Тогда
					СуммаАванса = Строка.КонечныйОстаток;
					ВалютнаяСуммаАванса = Строка.ВалютныйКонечныйОстаток;
				Иначе
					СуммаАванса = Строка.НачальныйОстаток;
					ВалютнаяСуммаАванса = Строка.ВалютныйНачальныйОстаток;
				КонецЕсли;
				Если СуммаАванса <> 0 Тогда

					Если Строка.ДатаВыписки = '00010101' Тогда
						Если ДатаЗачетаАванса > Строка.Период Тогда
							Строка.ДатаВыписки = Строка.Период;
						Иначе
							Строка.ДатаВыписки = ДатаЗачетаАванса;
						КонецЕсли;
					КонецЕсли;
					Строка.КонецНалоговогоПериода = КонецКвартала(Строка.ДокументАвансаДата);

					Если НЕ ЗначениеЗаполнено(Строка.СчетФактура)
						ИЛИ НачалоДня(Строка.ДатаВыписки) >= НачалоДня(СтруктураПараметров.НачалоПериода) Тогда
						
						НоваяСтрока = ТаблицаАвансов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						НоваяСтрока.СуммаАванса = СуммаАванса;
						НоваяСтрока.ВалютнаяСуммаАванса = ВалютнаяСуммаАванса;
						
					КонецЕсли;

					Прервать;

				КонецЕсли;
			КонецЕсли
		КонецЦикла;

	КонецЦикла;

	Если ТаблицаАвансов <> Неопределено
		И ТаблицаАвансов.Количество() <> 0 Тогда

		ТаблицаАвансов.Сортировать("ДокументАвансаДата Возр");

		Для Каждого Выборка Из ТаблицаАвансов Цикл

			ДокАванса = Выборка.ДокументОснование;
			ДокАвансаМетаданные = ДокАванса.Метаданные();

			Если НЕ ЗначениеЗаполнено(Выборка.ВалютаРасчетов) ИЛИ Выборка.РасчетыВУсловныхЕдиницах Тогда
				// Незаполненное значение приравнивается к валюте регл. учета
				ВалютаДокумента = ВалютаРегламентированногоУчета;
			Иначе
				ВалютаДокумента = Выборка.ВалютаРасчетов;
			КонецЕсли;

			Если ЗначениеЗаполнено(ДокАванса)
				И (ДокАвансаМетаданные.ТабличныеЧасти.Найти("РасшифровкаПлатежа") <> Неопределено
				ИЛИ ТипЗнч(ДокАванса) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")) Тогда

				ТаблицаПоСтавкам = Новый ТаблицаЗначений();
				ТаблицаПоСтавкам.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
				ТаблицаПоСтавкам.Колонки.Добавить("Сумма", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15,2));
				ТаблицаПоСтавкам.Колонки.Добавить("ВалютнаяСумма",
					ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15,2));
				ТаблицаПоСтавкам.Колонки.Добавить("СчетНаОплату",
					Новый ОписаниеТипов("ДокументСсылка.СчетНаОплатуПокупателю"));

				Если ТипЗнч(ДокАванса) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда

					ЕстьСчетНаОплату = Ложь;
					
					СтрокаПоСтавке = ТаблицаПоСтавкам.Добавить();
					СтрокаПоСтавке.СтавкаНДС = Выборка.СтавкаНДС;
					СтрокаПоСтавке.Сумма = Выборка.СуммаАванса;
					СтрокаПоСтавке.ВалютнаяСумма = Выборка.СуммаАванса;

				Иначе

					ЕстьСчетНаОплату =
						ДокАвансаМетаданные.ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты.Найти("СчетНаОплату") <> Неопределено;

					Для Каждого СтрПлатежа Из ДокАванса.РасшифровкаПлатежа Цикл
						Если СтрПлатежа.ДоговорКонтрагента = Выборка.ДоговорКонтрагента Тогда

							Если СоответствиеСтавок[СтрПлатежа.СтавкаНДС] = Неопределено Тогда
								ТекСтавкаНДС = СтрПлатежа.СтавкаНДС;
							Иначе
								ТекСтавкаНДС = СоответствиеСтавок[СтрПлатежа.СтавкаНДС];
							КонецЕсли;
							СтрокаПоСтавке 				 = ТаблицаПоСтавкам.Добавить();
							СтрокаПоСтавке.СтавкаНДС 	 = ТекСтавкаНДС;
							СтрокаПоСтавке.Сумма 		 = СтрПлатежа.СуммаПлатежа;
							СтрокаПоСтавке.ВалютнаяСумма = СтрПлатежа.СуммаПлатежа;
							Если ЕстьСчетНаОплату Тогда
								СтрокаПоСтавке.СчетНаОплату = СтрПлатежа.СчетНаОплату;
							КонецЕсли;

						КонецЕсли;
					КонецЦикла;

				КонецЕсли;

				ТаблицаПоСтавкам.Свернуть("СтавкаНДС, СчетНаОплату", "Сумма, ВалютнаяСумма");

				// Распределение суммы рег учета
				МассивСумм = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(
					Выборка.СуммаАванса,
					ТаблицаПоСтавкам.ВыгрузитьКолонку("Сумма"));
				Если НЕ МассивСумм = Неопределено Тогда
					ТаблицаПоСтавкам.ЗагрузитьКолонку(МассивСумм,"Сумма");
				Иначе
					МассивСумм = ТаблицаПоСтавкам.ВыгрузитьКолонку("Сумма");
				КонецЕсли;

				// Распределение валютной суммы
				Если НЕ ЗначениеЗаполнено(Выборка.ВалютнаяСуммаАванса) ИЛИ ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
					Если НЕ МассивСумм = Неопределено Тогда
						ТаблицаПоСтавкам.ЗагрузитьКолонку(МассивСумм,"ВалютнаяСумма");
					КонецЕсли;
				Иначе
					МассивСуммВал = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(
						Выборка.ВалютнаяСуммаАванса,
					ТаблицаПоСтавкам.ВыгрузитьКолонку("ВалютнаяСумма"));
					Если НЕ МассивСуммВал = Неопределено Тогда
						ТаблицаПоСтавкам.ЗагрузитьКолонку(МассивСуммВал,"ВалютнаяСумма");
					Иначе
						ТаблицаПоСтавкам.ЗагрузитьКолонку(МассивСумм,"ВалютнаяСумма");
					КонецЕсли;
				КонецЕсли;

				Для Каждого СтрокаПоСтавке Из ТаблицаПоСтавкам Цикл

					Если СтрокаПоСтавке.СтавкаНДС = Перечисления.СтавкиНДС.НДС0
						ИЛИ СтрокаПоСтавке.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
						Продолжить;
					КонецЕсли;

					СтрокаТП = ТаблицаРезультатов.Добавить();
					
					Если ТипЗнч(Выборка.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
						СтрокаТП.ДатаДокументаОснования	= Выборка.ДатаСобытия;
						СтрокаТП.Дата = Выборка.ДатаСобытия;
					Иначе
						СтрокаТП.ДатаДокументаОснования	= Выборка.ДокументАвансаДата;
						СтрокаТП.Дата = Выборка.ДатаВыписки;
					КонецЕсли;
					
					СтрокаТП.Контрагент                            = Выборка.Контрагент;
					СтрокаТП.ДоговорКонтрагента                    = Выборка.ДоговорКонтрагента;
					СтрокаТП.ДокументОснование                     = Выборка.ДокументОснование;
					СтрокаТП.СчетНаОплату                          = СтрокаПоСтавке.СчетНаОплату;
					СтрокаТП.ВалютаДокумента                       = ВалютаДокумента;
					СтрокаТП.Сумма                                 = СтрокаПоСтавке.Сумма;
					СтрокаТП.ВалютнаяСумма                         = СтрокаПоСтавке.ВалютнаяСумма;
					СтрокаТП.СтавкаНДС                             = СтрокаПоСтавке.СтавкаНДС;
					СтрокаТП.СчетФактура                           = Выборка.СчетФактура;
					СтрокаТП.ПорядокРегистрацииСчетовФактурНаАванс = Выборка.ПорядокРегистрацииСчетовФактурНаАванс;
					СтрокаТП.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(СтрокаТП.Сумма, Истина, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТП.СтавкаНДС));

				КонецЦикла;

			Иначе

				СтрокаТП                        = ТаблицаРезультатов.Добавить();
				СтрокаТП.Дата                   = Выборка.ДатаВыписки;
				СтрокаТП.ДатаДокументаОснования = Выборка.ДокументАвансаДата;
				СтрокаТП.Контрагент             = Выборка.Контрагент;
				СтрокаТП.ДоговорКонтрагента     = Выборка.ДоговорКонтрагента;
				СтрокаТП.ДокументОснование      = Выборка.ДокументОснование;
				СтрокаТП.ВалютаДокумента        = ВалютаДокумента;
				СтрокаТП.Сумма                  = Выборка.СуммаАванса;
				СтрокаТП.СтавкаНДС              = Перечисления.СтавкиНДС.НДС18_118;

				Если НЕ ЗначениеЗаполнено(Выборка.ВалютнаяСуммаАванса) ИЛИ ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
					СтрокаТП.ВалютнаяСумма = СтрокаТП.Сумма;
				Иначе
					СтрокаТП.ВалютнаяСумма = Выборка.ВалютнаяСуммаАванса;
				КонецЕсли;
				СтрокаТП.СчетФактура = Выборка.СчетФактура;
				СтрокаТП.ПорядокРегистрацииСчетовФактурНаАванс = Выборка.ПорядокРегистрацииСчетовФактурНаАванс;
				СтрокаТП.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(СтрокаТП.Сумма, Истина, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТП.СтавкаНДС));
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ОпределитьРанееВыписанныеСчетаФактуры(ТаблицаАвансов)
	
	Если ТаблицаАвансов.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка КАК СчетФактура,
		|	НАЧАЛОПЕРИОДА(СчетФактураВыданный.Ссылка.Дата, ДЕНЬ) КАК ДатаСобытия,
		|	СчетФактураВыданный.Ссылка.ДоговорКонтрагента,
		|	СчетФактураВыданный.ДокументОснование,
		|	СчетФактураВыданный.Ссылка.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование В(&ДокументыОснования)
		|	И СчетФактураВыданный.Ссылка.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента))
		|	И СчетФактураВыданный.Ссылка.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ДокументыОснования", ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(ТаблицаАвансов.ВыгрузитьКолонку("ДокументОснование"), Истина));
		
		СФПоДокументам = Запрос.Выполнить().Выгрузить();
		
		Если СФПоДокументам.Количество() > 0 Тогда
			
			СтруктураОтбора = Новый Структура("ДокументОснование, Контрагент, ДатаСобытия, ДоговорКонтрагента");
			

			Для Каждого СФ Из СФПоДокументам Цикл
				ЗаполнитьЗначенияСвойств(СтруктураОтбора, СФ);
				СтрокиОтбора = ТаблицаАвансов.НайтиСтроки(СтруктураОтбора);
				Для Каждого СтрокаОтбора Из СтрокиОтбора Цикл
					СтрокаОтбора.СчетФактура = СФ.СчетФактура;
					СтрокаОтбора.ДатаВыписки = СФ.ДатаСобытия;
				КонецЦикла;
				
				СтруктураОтбора.ДатаСобытия = '00010101';
				СтрокиОтбора = ТаблицаАвансов.НайтиСтроки(СтруктураОтбора);
				Для Каждого СтрокаОтбора Из СтрокиОтбора Цикл
					СтрокаОтбора.СчетФактура = СФ.СчетФактура;
					СтрокаОтбора.ДатаВыписки = СФ.ДатаСобытия;
				КонецЦикла;
				
			КонецЦикла;
						
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


// ПРОЦЕДУРЫ СОЗДАНИЯ СЧЕТОВ-ФАКТУР

Процедура СформироватьСчетаФактуры(СтруктураПараметров, АдресХранилища) Экспорт

	Список = СтруктураПараметров.ТаблицыСчетовФактур.Список;
	НеиспользуемыеСчетаФактуры = СтруктураПараметров.ТаблицыСчетовФактур.НеиспользуемыеСчетаФактуры;

	ЕстьОшибки = ВыполнитьФормированиеСчетовФактурНаАванс(СтруктураПараметров, Список, НеиспользуемыеСчетаФактуры);

	Если Не ЕстьОшибки Тогда
		РегистрыСведений.ВыполнениеРегламентныхОперацийНДС.ЗафиксироватьФактВыполненияРегламентнойОперации(
					НачалоКвартала(СтруктураПараметров.НачалоПериода),
					СтруктураПараметров.Организация, Неопределено, Перечисления.РегламентныеОперации.РегистрацияСчетовФактурНаАванс, НЕ ЕстьОшибки);	
	КонецЕсли; 
	
	ДанныеДляЗаполнения = Новый Структура;
	ДанныеДляЗаполнения.Вставить("Список", Список);

	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);

КонецПроцедуры

Функция ВыполнитьФормированиеСчетовФактурНаАванс(СтруктураПараметров, Список, НеиспользуемыеСчетаФактуры)

	Если СтруктураПараметров.Свойство("ОчиститьСписокНеиспользуемыхСчетовФактур")
		И СтруктураПараметров.ОчиститьСписокНеиспользуемыхСчетовФактур Тогда
		НеиспользуемыеСчетаФактуры.Очистить();
	КонецЕсли;

	Если СтруктураПараметров.Свойство("УстановитьПометкиУдаления")
		И СтруктураПараметров.УстановитьПометкиУдаления Тогда
		УстановитьПометкиУдаления(НеиспользуемыеСчетаФактуры);
	КонецЕсли;

	ЕстьОшибки = Ложь;

	ИспользоватьРанееОбнаруженныеДокументы = (НеиспользуемыеСчетаФактуры.Количество()>0);

	ПустаяСсылкаСФ = Новый(Тип("ДокументСсылка.СчетФактураВыданный"));
	////////////////////////////////////////////////////////////////////////////
	// Предварительная установка пометки на удаление для СФ, выбранных в таблице
	
	КолонкаСчетФактура = Список.ВыгрузитьКолонку("СчетФактура");
	СписокСФ = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(КолонкаСчетФактура , Истина);
	Для Каждого СчФ Из СписокСФ Цикл
		Если СчФ = ПустаяСсылкаСФ Тогда
			Продолжить;
		Иначе
			СчФ = СчФ.Ссылка.ПолучитьОбъект();
			СчФ.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЦикла;
	
	// Предварительная установка пометки на удаление для СФ, выбранных в таблице
	////////////////////////////////////////////////////////////////////////////
	
	КолонкаДокОснование = Список.ВыгрузитьКолонку("ДокументОснование");
	МассивДокументов = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(КолонкаДокОснование);
	
	ТаблицаКлючевыхПолей = Новый ТаблицаЗначений;
	ТаблицаКлючевыхПолей.Колонки.Добавить("Контрагент");
	ТаблицаКлючевыхПолей.Колонки.Добавить("Дата");
	ТаблицаКлючевыхПолей.Колонки.Добавить("ДоговорКонтрагента");

	СтруктураОтбораДокумент = Новый Структура("ДокументОснование");
	СтруктураОтбораДоговор = Новый Структура("ДокументОснование, Контрагент, ДоговорКонтрагента, Дата");
	Ответственный = Пользователи.ТекущийПользователь();

	Для Каждого Документ Из МассивДокументов Цикл

		СтруктураОтбораДокумент.ДокументОснование = Документ;
		СтрокиПоДокументу = Список.НайтиСтроки(СтруктураОтбораДокумент);

		ТаблицаКлючевыхПолей.Очистить();
		
		Для Каждого СтрокаПоДокументу Из СтрокиПоДокументу Цикл
			СтрокаКонтрагентДата = ТаблицаКлючевыхПолей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКонтрагентДата, СтрокаПоДокументу);
		КонецЦикла;
		
		// Для различных контрагентов, договора с контрагентом и даты аванса, 
		// при общем документе-основании, выписывается отдельный счет-фактура
		ТаблицаКлючевыхПолей.Свернуть("Контрагент, ДоговорКонтрагента, Дата");

		Для Каждого СтрокаКонтрагентДата Из ТаблицаКлючевыхПолей Цикл
			
			СтруктураОтбораДоговор.ДокументОснование = Документ;
			СтруктураОтбораДоговор.Контрагент = СтрокаКонтрагентДата.Контрагент;
			СтруктураОтбораДоговор.ДоговорКонтрагента = СтрокаКонтрагентДата.ДоговорКонтрагента;
			СтруктураОтбораДоговор.Дата = СтрокаКонтрагентДата.Дата;
			
			СтрокиПоДоговору = Список.НайтиСтроки(СтруктураОтбораДоговор);
			
			ТЧАвансыСтарые = Новый Соответствие;

			СчФ = Неопределено;
			ТЧАвансыСтарые.Очистить();

			ОшибкаФормирования = Ложь;

			Для Каждого СтрокаОтбораДоговор Из СтрокиПоДоговору Цикл

				Если СчФ = Неопределено Тогда
					// Создать/использовать Счет-фактуру
					Если НЕ СтрокаОтбораДоговор.СчетФактура = ПустаяСсылкаСФ Тогда
						СчФ = СтрокаОтбораДоговор.СчетФактура.ПолучитьОбъект();
						Если ТЧАвансыСтарые[СчФ] = Неопределено Тогда
							ТЧАвансыСтарые.Вставить(СчФ, СчФ.Авансы.Выгрузить());
						КонецЕсли;
					ИначеЕсли ИспользоватьРанееОбнаруженныеДокументы Тогда
						СчФ = НеиспользуемыеСчетаФактуры.Найти(Ложь,"Использован");
						Если СчФ = Неопределено Тогда
							ИспользоватьРанееОбнаруженныеДокументы = Ложь;
							СчФ = Документы.СчетФактураВыданный.СоздатьДокумент();
							СчФ.Ответственный = Ответственный;
						Иначе
							СчФ.Использован = Истина;
							СчФ = СчФ.Ссылка.ПолучитьОбъект();
						КонецЕсли;
					Иначе
						СчФ = Документы.СчетФактураВыданный.СоздатьДокумент();
						СчФ.Ответственный = Ответственный;
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(СчФ, СтрокаОтбораДоговор);
					СчФ.Организация = СтруктураПараметров.Организация;
					
					Если СчФ.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАванс
						И СчФ.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
						
						СчФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс;
						
					КонецЕсли;
															
					СчФ.Под0 = Ложь;
					СчФ.СформированПриВводеНачальныхОстатковНДС = Ложь;
					
					СчФ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
					
					Если УчетНДСПереопределяемый.ИспользуетсяПостановлениеНДС1137(СчФ.Дата) Тогда
						Если СчФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
							СчФ.КодВидаОперации = "05";
						Иначе 
							СчФ.КодВидаОперации = "02";
						КонецЕсли;
						СчФ.КодСпособаВыставления = 1;
					КонецЕсли;	
					
					ПараметрыЗаполнения = Новый Структура("СчетФактураНеВыставляется, ДокументОснование, ВидСчетаФактуры, Дата");
					ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, СчФ);
					
					ПараметрыВыставления = Документы.СчетФактураВыданный.ОпределитьПорядокВыставленияСчетаФактуры(ПараметрыЗаполнения);
					ЗаполнитьЗначенияСвойств(СчФ, ПараметрыВыставления);
										
					СчФ.ДокументыОснования.Очистить();
					СчФ.ДокументыОснования.Добавить().ДокументОснование = СтрокаОтбораДоговор.ДокументОснование;

					СчФ.СуммаДокумента = СтрокаОтбораДоговор.ВалютнаяСумма;

					СчФ.Авансы.Очистить();

					СчФ.ПометкаУдаления = Ложь;

					СчФ.Дата = КонецДня(СчФ.Дата);

					ТипОснования = ТипЗнч(СтрокаОтбораДоговор.ДокументОснование);

					СчФ.ПлатежноРасчетныеДокументы.Очистить();

					Если ТипОснования = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
						СчФ.НомерПлатежноРасчетногоДокумента = СчФ.ДокументОснование.НомерВходящегоДокумента;
						СчФ.ДатаПлатежноРасчетногоДокумента = СчФ.ДокументОснование.ДатаВходящегоДокумента;
					ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
						СчФ.НомерПлатежноРасчетногоДокумента =
							ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СчФ.ДокументОснование.Номер, Истина, Истина);
						СчФ.ДатаПлатежноРасчетногоДокумента = СчФ.ДокументОснование.Дата;
					Иначе
						СчФ.НомерПлатежноРасчетногоДокумента = "";
						СчФ.ДатаПлатежноРасчетногоДокумента  = Неопределено;
					КонецЕсли;

					СтрокаПРД = СчФ.ПлатежноРасчетныеДокументы.Добавить();
					СтрокаПРД.ДатаДокумента	= СчФ.ДатаПлатежноРасчетногоДокумента;
					СтрокаПРД.НомерДокумента = СчФ.НомерПлатежноРасчетногоДокумента;

				Иначе
					СчФ.Сумма 		   = СчФ.Сумма + СтрокаОтбораДоговор.Сумма;
					СчФ.СуммаНДС 	   = СчФ.СуммаНДС + СтрокаОтбораДоговор.СуммаНДС;
					СчФ.СуммаДокумента = СчФ.СуммаДокумента + СтрокаОтбораДоговор.ВалютнаяСумма;
				КонецЕсли;

				СуммаПоСтроке 	  = СтрокаОтбораДоговор.Сумма;
				СуммаНДСПоСтроке  = СтрокаОтбораДоговор.СуммаНДС;
				СтавкаНДСПоСтроке = СтрокаОтбораДоговор.СтавкаНДС;

				Если ЗначениеЗаполнено(СтрокаОтбораДоговор.СчетНаОплату) Тогда
					ТаблицаАвансов = ПолучитьНоменклатуруСчетаНаОплату(
						СтрокаОтбораДоговор.СчетНаОплату, СтрокаОтбораДоговор, СчФ.Авансы.ВыгрузитьКолонки());
					ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ТаблицаАвансов, СчФ.Авансы);
				Иначе
					Если ТЧАвансыСтарые[СчФ] <> Неопределено Тогда
						Для Каждого СтрокаСтарая Из ТЧАвансыСтарые[СчФ] Цикл
							Если СуммаПоСтроке = 0 Тогда
								Прервать;
							КонецЕсли;
							Если СтрокаСтарая.Сумма = 0 Тогда
								Продолжить;
							КонецЕсли;
							Если СтрокаОтбораДоговор.СтавкаНДС = СтрокаСтарая.СтавкаНДС Тогда
								НоваяСтрокаПоСуммам 			 = СчФ.Авансы.Добавить();
								НоваяСтрокаПоСуммам.Номенклатура = СтрокаСтарая.Номенклатура;
								НоваяСтрокаПоСуммам.Содержание 	 = СтрокаСтарая.Содержание;
								НоваяСтрокаПоСуммам.Сумма 		 = Мин(СуммаПоСтроке, СтрокаСтарая.Сумма);
								НоваяСтрокаПоСуммам.СуммаНДС 	 = Мин(СуммаНДСПоСтроке, СтрокаСтарая.СуммаНДС);
								НоваяСтрокаПоСуммам.СтавкаНДС 	 = СтрокаОтбораДоговор.СтавкаНДС;
								СуммаПоСтроке 					 = СуммаПоСтроке - НоваяСтрокаПоСуммам.Сумма;
								СуммаНДСПоСтроке 				 = СуммаНДСПоСтроке - НоваяСтрокаПоСуммам.СуммаНДС;
								СтрокаСтарая.Сумма 				 = СтрокаСтарая.Сумма - НоваяСтрокаПоСуммам.Сумма;
								СтрокаСтарая.СуммаНДС 			 = СтрокаСтарая.СуммаНДС - НоваяСтрокаПоСуммам.СуммаНДС;
							КонецЕсли;
						КонецЦикла;
						Если СуммаПоСтроке <> 0 Тогда
							НоваяСтрокаПоСуммам 			 = СчФ.Авансы.Добавить();
							НоваяСтрокаПоСуммам.Сумма 		 = СуммаПоСтроке;
							НоваяСтрокаПоСуммам.СуммаНДС 	 = СуммаНДСПоСтроке;
							НоваяСтрокаПоСуммам.СтавкаНДС 	 = СтрокаОтбораДоговор.СтавкаНДС;
							НоваяСтрокаПоСуммам.Номенклатура = СтрокаОтбораДоговор.ДоговорКонтрагента.НаименованиеДляСчетаФактурыНаАванс;
						КонецЕсли;
					Иначе
						НоваяСтрокаПоСуммам = СчФ.Авансы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаПоСуммам, СтрокаОтбораДоговор);
						НоваяСтрокаПоСуммам.Номенклатура = СтрокаОтбораДоговор.ДоговорКонтрагента.НаименованиеДляСчетаФактурыНаАванс;
					КонецЕсли;

				КонецЕсли;

			КонецЦикла;
			
			Если СчФ.ЭтоНовый() Тогда
				ОтветственныеЛицаБП.УстановитьОтветственныхЛиц(СчФ);
			КонецЕсли;
			
			Попытка
				НовыйСФ = СчФ.ЭтоНовый();
				СчФ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);

				Для Каждого СтрокаОтбораДоговор Из СтрокиПоДоговору Цикл
					СтрокаОтбораДоговор.СФсформирован = Истина;
					СтрокаОтбораДоговор.СчетФактура = СчФ.Ссылка;
				КонецЦикла;
			Исключение
				Для Каждого СтрокаОтбораДоговор Из СтрокиПоДоговору Цикл
					СтрокаОтбораДоговор.СФсформирован = Ложь;
					СтрокаОтбораДоговор.СчетФактура   = Неопределено;
				КонецЦикла;
				ЕстьОшибки = Истина;
			КонецПопытки;

		КонецЦикла;

	КонецЦикла;

	Возврат ЕстьОшибки;

КонецФункции

Процедура УстановитьПометкиУдаления(НеиспользуемыеСчетаФактуры)

	Для Каждого Документ Из НеиспользуемыеСчетаФактуры Цикл
		Если НЕ Документ.ПометкаУдаления Тогда
			ДокументОбъект = Документ.Ссылка.ПолучитьОбъект();
			ДокументОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьНоменклатуруСчетаНаОплату(СчетНаОплату, СтрокаОтбора, ТаблицаРезультата)

	СоответствиеСтавок = Новый Соответствие;
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС10_110, Перечисления.СтавкиНДС.НДС10);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС18_118, Перечисления.СтавкиНДС.НДС18);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС20_120, Перечисления.СтавкиНДС.НДС20);

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("СчетНаОплату", СчетНаОплату);
	СтавкиНДС = Новый СписокЗначений;
	СтавкиНДС.Добавить(СтрокаОтбора.СтавкаНДС);
	СтавкиНДС.Добавить(СоответствиеСтавок[СтрокаОтбора.СтавкаНДС]);
	Запрос.УстановитьПараметр("СтавкиНДС", СтавкиНДС);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура,
	|	"""" КАК Содержание,
	|	СчетНаОплатуПокупателюТовары.СтавкаНДС КАК СтавкаНДС,
	|	СчетНаОплатуПокупателюТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА СчетНаОплатуПокупателюТовары.Сумма
	|		ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
	|		ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	СчетНаОплатуПокупателюТовары.НомерСтроки КАК НомерСтроки,
	|	СчетНаОплатуПокупателюТовары.Ссылка.ВалютаДокумента,
	|	1 КАК ID
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|ГДЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка = &СчетНаОплату
	|	И СчетНаОплатуПокупателюТовары.СтавкаНДС В(&СтавкиНДС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателюУслуги.Номенклатура,
	|	СчетНаОплатуПокупателюУслуги.Содержание,
	|	СчетНаОплатуПокупателюУслуги.СтавкаНДС,
	|	СчетНаОплатуПокупателюУслуги.СуммаНДС,
	|	ВЫБОР
	|		КОГДА СчетНаОплатуПокупателюУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА СчетНаОплатуПокупателюУслуги.Сумма
	|		ИНАЧЕ СчетНаОплатуПокупателюУслуги.Сумма + СчетНаОплатуПокупателюУслуги.СуммаНДС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетНаОплатуПокупателюУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА СчетНаОплатуПокупателюУслуги.Сумма - СчетНаОплатуПокупателюУслуги.СуммаНДС
	|		ИНАЧЕ СчетНаОплатуПокупателюУслуги.Сумма
	|	КОНЕЦ,
	|	СчетНаОплатуПокупателюУслуги.НомерСтроки,
	|	СчетНаОплатуПокупателюУслуги.Ссылка.ВалютаДокумента,
	|	2
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Услуги КАК СчетНаОплатуПокупателюУслуги
	|ГДЕ
	|	СчетНаОплатуПокупателюУслуги.Ссылка = &СчетНаОплату
	|	И СчетНаОплатуПокупателюУслуги.СтавкаНДС В(&СтавкиНДС)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ID,
	|	НомерСтроки";

	Результат = Запрос.Выполнить().Выгрузить();

	Сумма 	 = СтрокаОтбора.Сумма;
	СуммаНДС = СтрокаОтбора.СуммаНДС;
	
	Если Результат.Количество() <> 0 Тогда

		Результат.Колонки.Добавить("СуммаРаспределение", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15,2));
		Результат.ЗагрузитьКолонку(ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СтрокаОтбора.Сумма, Результат.ВыгрузитьКолонку("Сумма")), "СуммаРаспределение");	
				
		МассивРаспределения = Новый Массив;

		Для Каждого СтрокаРезультата Из Результат Цикл

			СтруктураКурсов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрокаРезультата.ВалютаДокумента, СтрокаОтбора.ДокументОснование.Дата);

			Если СтрокаРезультата.ВалютаДокумента <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
				СтрокаРезультата.Сумма = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(
					СтрокаРезультата.Сумма,
					СтрокаРезультата.ВалютаДокумента, Константы.ВалютаРегламентированногоУчета.Получить(),
					СтруктураКурсов.Курс, 1,
					СтруктураКурсов.Кратность, 1);
				СтрокаРезультата.СуммаНДС 	 = УчетНДСКлиентСервер.РассчитатьСуммуНДС(СтрокаРезультата.Сумма, Истина, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаРезультата.СтавкаНДС));
				СтрокаРезультата.СуммаБезНДС = СтрокаРезультата.Сумма - СтрокаРезультата.СуммаНДС;
			КонецЕсли;

			МассивРаспределения.Очистить();
			МассивРаспределения.Добавить(СтрокаРезультата.СуммаБезНДС);
			МассивРаспределения.Добавить(СтрокаРезультата.СуммаНДС);

			РезультатРаспределения = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СтрокаРезультата.СуммаРаспределение, МассивРаспределения);

			Если НЕ РезультатРаспределения = Неопределено Тогда

				СтрокаРезультата.СуммаНДС 	 = Мин(СтрокаРезультата.СуммаНДС, РезультатРаспределения[1]);
				СтрокаРезультата.СуммаБезНДС = Мин(СтрокаРезультата.СуммаБезНДС, РезультатРаспределения[0]);
				СтрокаРезультата.Сумма 		 = СтрокаРезультата.СуммаБезНДС + СтрокаРезультата.СуммаНДС;

				ДобавитьСтрокуАвансы(
					ТаблицаРезультата, СтрокаРезультата.Номенклатура, СтрокаРезультата.Содержание, СтрокаРезультата.Сумма, СтрокаРезультата.СуммаНДС, СтрокаРезультата.СтавкаНДС);

				Сумма 	 = Сумма - СтрокаРезультата.Сумма;
				СуммаНДС = СуммаНДС - СтрокаРезультата.СуммаНДС;

			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если Сумма <> 0 Тогда
		ДобавитьСтрокуАвансы(ТаблицаРезультата, СтрокаОтбора.ДоговорКонтрагента.НаименованиеДляСчетаФактурыНаАванс, , Сумма, СуммаНДС, СтрокаОтбора.СтавкаНДС);
	КонецЕсли;

	ТаблицаРезультата.Свернуть("Номенклатура, Содержание, СтавкаНДС", "Сумма, СуммаНДС");

	Возврат ТаблицаРезультата;

КонецФункции

Процедура ДобавитьСтрокуАвансы(ТаблицаРезультата, Номенклатура, Содержание = "", Сумма, СуммаНДС, СтавкаНДС)

	СоответствиеСтавок = Новый Соответствие;
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС10_110, Перечисления.СтавкиНДС.НДС10_110);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС18_118, Перечисления.СтавкиНДС.НДС18_118);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС20_120, Перечисления.СтавкиНДС.НДС20_120);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС10, Перечисления.СтавкиНДС.НДС10_110);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС18, Перечисления.СтавкиНДС.НДС18_118);
	СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС20_120);

	НоваяСтрока = ТаблицаРезультата.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Содержание = Содержание;

	Если ПустаяСтрока(НоваяСтрока.Содержание)
		И ЗначениеЗаполнено(НоваяСтрока.Номенклатура)
		И НоваяСтрока.Номенклатура.Услуга Тогда
			НоваяСтрока.Содержание = НоваяСтрока.Номенклатура.НаименованиеПолное;
	КонецЕсли;

	НоваяСтрока.Сумма     = Сумма;
	НоваяСтрока.СуммаНДС  = СуммаНДС;
	НоваяСтрока.СтавкаНДС = СоответствиеСтавок[СтавкаНДС];

КонецПроцедуры
#КонецЕсли
